MikroElektronika/core_packages/PIC/XC8/def/PIC18F4585/mcu.h
extern volatile B1D6bits_t B1D6bits __at(0xE3C);
// bitfield macros
#define _B1D6_B1D60_POSN                                    0x0
#define _B1D6_B1D60_POSITION                                0x0
#define _B1D6_B1D60_SIZE                                    0x1
#define _B1D6_B1D60_LENGTH                                  0x1
#define _B1D6_B1D60_MASK                                    0x1
#define _B1D6_B1D61_POSN                                    0x1
#define _B1D6_B1D61_POSITION                                0x1
#define _B1D6_B1D61_SIZE                                    0x1
#define _B1D6_B1D61_LENGTH                                  0x1
#define _B1D6_B1D61_MASK                                    0x2
#define _B1D6_B1D62_POSN                                    0x2
#define _B1D6_B1D62_POSITION                                0x2
#define _B1D6_B1D62_SIZE                                    0x1
#define _B1D6_B1D62_LENGTH                                  0x1
#define _B1D6_B1D62_MASK                                    0x4
#define _B1D6_B1D63_POSN                                    0x3
#define _B1D6_B1D63_POSITION                                0x3
#define _B1D6_B1D63_SIZE                                    0x1
#define _B1D6_B1D63_LENGTH                                  0x1
#define _B1D6_B1D63_MASK                                    0x8
#define _B1D6_B1D64_POSN                                    0x4
#define _B1D6_B1D64_POSITION                                0x4
#define _B1D6_B1D64_SIZE                                    0x1
#define _B1D6_B1D64_LENGTH                                  0x1
#define _B1D6_B1D64_MASK                                    0x10
#define _B1D6_B1D65_POSN                                    0x5
#define _B1D6_B1D65_POSITION                                0x5
#define _B1D6_B1D65_SIZE                                    0x1
#define _B1D6_B1D65_LENGTH                                  0x1
#define _B1D6_B1D65_MASK                                    0x20
#define _B1D6_B1D66_POSN                                    0x6
#define _B1D6_B1D66_POSITION                                0x6
#define _B1D6_B1D66_SIZE                                    0x1
#define _B1D6_B1D66_LENGTH                                  0x1
#define _B1D6_B1D66_MASK                                    0x40
#define _B1D6_B1D67_POSN                                    0x7
#define _B1D6_B1D67_POSITION                                0x7
#define _B1D6_B1D67_SIZE                                    0x1
#define _B1D6_B1D67_LENGTH                                  0x1
#define _B1D6_B1D67_MASK                                    0x80

// Register: B1D7
#define B1D7 B1D7
extern volatile unsigned char           B1D7                __at(0xE3D);
#ifndef _LIB_BUILD
asm("B1D7 equ 0E3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D70                  :1;
        unsigned B1D71                  :1;
        unsigned B1D72                  :1;
        unsigned B1D73                  :1;
        unsigned B1D74                  :1;
        unsigned B1D75                  :1;
        unsigned B1D76                  :1;
        unsigned B1D77                  :1;
    };
} B1D7bits_t;
extern volatile B1D7bits_t B1D7bits __at(0xE3D);
// bitfield macros
#define _B1D7_B1D70_POSN                                    0x0
#define _B1D7_B1D70_POSITION                                0x0
#define _B1D7_B1D70_SIZE                                    0x1
#define _B1D7_B1D70_LENGTH                                  0x1
#define _B1D7_B1D70_MASK                                    0x1
#define _B1D7_B1D71_POSN                                    0x1
#define _B1D7_B1D71_POSITION                                0x1
#define _B1D7_B1D71_SIZE                                    0x1
#define _B1D7_B1D71_LENGTH                                  0x1
#define _B1D7_B1D71_MASK                                    0x2
#define _B1D7_B1D72_POSN                                    0x2
#define _B1D7_B1D72_POSITION                                0x2
#define _B1D7_B1D72_SIZE                                    0x1
#define _B1D7_B1D72_LENGTH                                  0x1
#define _B1D7_B1D72_MASK                                    0x4
#define _B1D7_B1D73_POSN                                    0x3
#define _B1D7_B1D73_POSITION                                0x3
#define _B1D7_B1D73_SIZE                                    0x1
#define _B1D7_B1D73_LENGTH                                  0x1
#define _B1D7_B1D73_MASK                                    0x8
#define _B1D7_B1D74_POSN                                    0x4
#define _B1D7_B1D74_POSITION                                0x4
#define _B1D7_B1D74_SIZE                                    0x1
#define _B1D7_B1D74_LENGTH                                  0x1
#define _B1D7_B1D74_MASK                                    0x10
#define _B1D7_B1D75_POSN                                    0x5
#define _B1D7_B1D75_POSITION                                0x5
#define _B1D7_B1D75_SIZE                                    0x1
#define _B1D7_B1D75_LENGTH                                  0x1
#define _B1D7_B1D75_MASK                                    0x20
#define _B1D7_B1D76_POSN                                    0x6
#define _B1D7_B1D76_POSITION                                0x6
#define _B1D7_B1D76_SIZE                                    0x1
#define _B1D7_B1D76_LENGTH                                  0x1
#define _B1D7_B1D76_MASK                                    0x40
#define _B1D7_B1D77_POSN                                    0x7
#define _B1D7_B1D77_POSITION                                0x7
#define _B1D7_B1D77_SIZE                                    0x1
#define _B1D7_B1D77_LENGTH                                  0x1
#define _B1D7_B1D77_MASK                                    0x80

// Register: CANSTAT_RO8
#define CANSTAT_RO8 CANSTAT_RO8
extern volatile unsigned char           CANSTAT_RO8         __at(0xE3E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO8 equ 0E3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO8bits_t;
extern volatile CANSTAT_RO8bits_t CANSTAT_RO8bits __at(0xE3E);
// bitfield macros
#define _CANSTAT_RO8_EICODE0_POSN                           0x0
#define _CANSTAT_RO8_EICODE0_POSITION                       0x0
#define _CANSTAT_RO8_EICODE0_SIZE                           0x1
#define _CANSTAT_RO8_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE0_MASK                           0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO8_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO8_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO8_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO8_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO8_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO8_EICODE4_POSN                           0x4
#define _CANSTAT_RO8_EICODE4_POSITION                       0x4
#define _CANSTAT_RO8_EICODE4_SIZE                           0x1
#define _CANSTAT_RO8_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE4_MASK                           0x10
#define _CANSTAT_RO8_OPMODE0_POSN                           0x5
#define _CANSTAT_RO8_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO8_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE0_MASK                           0x20
#define _CANSTAT_RO8_OPMODE1_POSN                           0x6
#define _CANSTAT_RO8_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO8_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE1_MASK                           0x40
#define _CANSTAT_RO8_OPMODE2_POSN                           0x7
#define _CANSTAT_RO8_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO8_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE2_MASK                           0x80
#define _CANSTAT_RO8_ICODE0_POSN                            0x0
#define _CANSTAT_RO8_ICODE0_POSITION                        0x0
#define _CANSTAT_RO8_ICODE0_SIZE                            0x1
#define _CANSTAT_RO8_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE0_MASK                            0x1
#define _CANSTAT_RO8_ICODE1_POSN                            0x1
#define _CANSTAT_RO8_ICODE1_POSITION                        0x1
#define _CANSTAT_RO8_ICODE1_SIZE                            0x1
#define _CANSTAT_RO8_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE1_MASK                            0x2
#define _CANSTAT_RO8_ICODE2_POSN                            0x2
#define _CANSTAT_RO8_ICODE2_POSITION                        0x2
#define _CANSTAT_RO8_ICODE2_SIZE                            0x1
#define _CANSTAT_RO8_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE2_MASK                            0x4
#define _CANSTAT_RO8_ICODE3_POSN                            0x3
#define _CANSTAT_RO8_ICODE3_POSITION                        0x3
#define _CANSTAT_RO8_ICODE3_SIZE                            0x1
#define _CANSTAT_RO8_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE3_MASK                            0x8
#define _CANSTAT_RO8_ICODE4_POSN                            0x4
#define _CANSTAT_RO8_ICODE4_POSITION                        0x4
#define _CANSTAT_RO8_ICODE4_SIZE                            0x1
#define _CANSTAT_RO8_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE4_MASK                            0x10

// Register: CANCON_RO8
#define CANCON_RO8 CANCON_RO8
extern volatile unsigned char           CANCON_RO8          __at(0xE3F);
#ifndef _LIB_BUILD
asm("CANCON_RO8 equ 0E3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO8bits_t;
