MikroElektronika/core_packages/PIC/XC8/def/PIC18F4585/mcu.h
extern volatile __bit                   FIL12_1             __at(0x6F99);	// @ (0xDF3 * 8 + 1)
#define                                 FIL12_1_bit         _BIT_ACCESS(MSEL3,1)
// MSEL3<FIL13_0>
extern volatile __bit                   FIL13_0             __at(0x6F9A);	// @ (0xDF3 * 8 + 2)
#define                                 FIL13_0_bit         _BIT_ACCESS(MSEL3,2)
// MSEL3<FIL13_1>
extern volatile __bit                   FIL13_1             __at(0x6F9B);	// @ (0xDF3 * 8 + 3)
#define                                 FIL13_1_bit         _BIT_ACCESS(MSEL3,3)
// MSEL3<FIL14_0>
extern volatile __bit                   FIL14_0             __at(0x6F9C);	// @ (0xDF3 * 8 + 4)
#define                                 FIL14_0_bit         _BIT_ACCESS(MSEL3,4)
// MSEL3<FIL14_1>
extern volatile __bit                   FIL14_1             __at(0x6F9D);	// @ (0xDF3 * 8 + 5)
#define                                 FIL14_1_bit         _BIT_ACCESS(MSEL3,5)
// MSEL3<FIL15_0>
extern volatile __bit                   FIL15_0             __at(0x6F9E);	// @ (0xDF3 * 8 + 6)
#define                                 FIL15_0_bit         _BIT_ACCESS(MSEL3,6)
// MSEL3<FIL15_1>
extern volatile __bit                   FIL15_1             __at(0x6F9F);	// @ (0xDF3 * 8 + 7)
#define                                 FIL15_1_bit         _BIT_ACCESS(MSEL3,7)
// MSEL0<FIL1_0>
extern volatile __bit                   FIL1_0              __at(0x6F82);	// @ (0xDF0 * 8 + 2)
#define                                 FIL1_0_bit          _BIT_ACCESS(MSEL0,2)
// MSEL0<FIL1_1>
extern volatile __bit                   FIL1_1              __at(0x6F83);	// @ (0xDF0 * 8 + 3)
#define                                 FIL1_1_bit          _BIT_ACCESS(MSEL0,3)
// MSEL0<FIL2_0>
extern volatile __bit                   FIL2_0              __at(0x6F84);	// @ (0xDF0 * 8 + 4)
#define                                 FIL2_0_bit          _BIT_ACCESS(MSEL0,4)
// MSEL0<FIL2_1>
extern volatile __bit                   FIL2_1              __at(0x6F85);	// @ (0xDF0 * 8 + 5)
#define                                 FIL2_1_bit          _BIT_ACCESS(MSEL0,5)
// MSEL0<FIL3_0>
extern volatile __bit                   FIL3_0              __at(0x6F86);	// @ (0xDF0 * 8 + 6)
#define                                 FIL3_0_bit          _BIT_ACCESS(MSEL0,6)
// MSEL0<FIL3_1>
extern volatile __bit                   FIL3_1              __at(0x6F87);	// @ (0xDF0 * 8 + 7)
#define                                 FIL3_1_bit          _BIT_ACCESS(MSEL0,7)
// MSEL1<FIL4_0>
extern volatile __bit                   FIL4_0              __at(0x6F88);	// @ (0xDF1 * 8 + 0)
#define                                 FIL4_0_bit          _BIT_ACCESS(MSEL1,0)
// MSEL1<FIL4_1>
extern volatile __bit                   FIL4_1              __at(0x6F89);	// @ (0xDF1 * 8 + 1)
#define                                 FIL4_1_bit          _BIT_ACCESS(MSEL1,1)
// MSEL1<FIL5_0>
extern volatile __bit                   FIL5_0              __at(0x6F8A);	// @ (0xDF1 * 8 + 2)
#define                                 FIL5_0_bit          _BIT_ACCESS(MSEL1,2)
// MSEL1<FIL5_1>
extern volatile __bit                   FIL5_1              __at(0x6F8B);	// @ (0xDF1 * 8 + 3)
#define                                 FIL5_1_bit          _BIT_ACCESS(MSEL1,3)
// MSEL1<FIL6_0>
extern volatile __bit                   FIL6_0              __at(0x6F8C);	// @ (0xDF1 * 8 + 4)
#define                                 FIL6_0_bit          _BIT_ACCESS(MSEL1,4)
// MSEL1<FIL6_1>
extern volatile __bit                   FIL6_1              __at(0x6F8D);	// @ (0xDF1 * 8 + 5)
#define                                 FIL6_1_bit          _BIT_ACCESS(MSEL1,5)
// MSEL1<FIL7_0>
extern volatile __bit                   FIL7_0              __at(0x6F8E);	// @ (0xDF1 * 8 + 6)
#define                                 FIL7_0_bit          _BIT_ACCESS(MSEL1,6)
// MSEL1<FIL7_1>
extern volatile __bit                   FIL7_1              __at(0x6F8F);	// @ (0xDF1 * 8 + 7)
#define                                 FIL7_1_bit          _BIT_ACCESS(MSEL1,7)
// MSEL2<FIL8_0>
extern volatile __bit                   FIL8_0              __at(0x6F90);	// @ (0xDF2 * 8 + 0)
#define                                 FIL8_0_bit          _BIT_ACCESS(MSEL2,0)
// MSEL2<FIL8_1>
extern volatile __bit                   FIL8_1              __at(0x6F91);	// @ (0xDF2 * 8 + 1)
#define                                 FIL8_1_bit          _BIT_ACCESS(MSEL2,1)
// MSEL2<FIL9_0>
extern volatile __bit                   FIL9_0              __at(0x6F92);	// @ (0xDF2 * 8 + 2)
#define                                 FIL9_0_bit          _BIT_ACCESS(MSEL2,2)
// MSEL2<FIL9_1>
extern volatile __bit                   FIL9_1              __at(0x6F93);	// @ (0xDF2 * 8 + 3)
#define                                 FIL9_1_bit          _BIT_ACCESS(MSEL2,3)
// SDFLC<FLC0>
extern volatile __bit                   FLC0                __at(0x6EC0);	// @ (0xDD8 * 8 + 0)
#define                                 FLC0_bit            _BIT_ACCESS(SDFLC,0)
// SDFLC<FLC1>
extern volatile __bit                   FLC1                __at(0x6EC1);	// @ (0xDD8 * 8 + 1)
#define                                 FLC1_bit            _BIT_ACCESS(SDFLC,1)
// SDFLC<FLC2>
extern volatile __bit                   FLC2                __at(0x6EC2);	// @ (0xDD8 * 8 + 2)
#define                                 FLC2_bit            _BIT_ACCESS(SDFLC,2)
// SDFLC<FLC3>
extern volatile __bit                   FLC3                __at(0x6EC3);	// @ (0xDD8 * 8 + 3)
#define                                 FLC3_bit            _BIT_ACCESS(SDFLC,3)
// SDFLC<FLC4>
extern volatile __bit                   FLC4                __at(0x6EC4);	// @ (0xDD8 * 8 + 4)
#define                                 FLC4_bit            _BIT_ACCESS(SDFLC,4)
// PORTB<FLT0>
extern volatile __bit                   FLT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 FLT0_bit            _BIT_ACCESS(PORTB,0)
// CANCON<FP0>
extern volatile __bit _DEPRECATED       FP0                 __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 FP0_bit             _BIT_ACCESS(CANCON,0)
// CANCON<FP1>
extern volatile __bit                   FP1                 __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 FP1_bit             _BIT_ACCESS(CANCON,1)
// CANCON<FP2>
extern volatile __bit                   FP2                 __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 FP2_bit             _BIT_ACCESS(CANCON,2)
// CANCON<FP3>
extern volatile __bit                   FP3                 __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 FP3_bit             _BIT_ACCESS(CANCON,3)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// SSPCON2<GCEN>
extern volatile __bit                   GCEN                __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSPCON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// HLVDCON<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON,4)
// PIE2<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x7D02);	// @ (0xFA0 * 8 + 2)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR2,2)
// PORTA<HLVDIN>
extern volatile __bit                   HLVDIN              __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 HLVDIN_bit          _BIT_ACCESS(PORTA,5)
// IPR2<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x7D12);	// @ (0xFA2 * 8 + 2)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR2,2)
// HLVDCON<HLVDL0>
extern volatile __bit                   HLVDL0              __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 HLVDL0_bit          _BIT_ACCESS(HLVDCON,0)
// HLVDCON<HLVDL1>
extern volatile __bit                   HLVDL1              __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 HLVDL1_bit          _BIT_ACCESS(HLVDCON,1)
// HLVDCON<HLVDL2>
extern volatile __bit                   HLVDL2              __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 HLVDL2_bit          _BIT_ACCESS(HLVDCON,2)
// HLVDCON<HLVDL3>
extern volatile __bit                   HLVDL3              __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 HLVDL3_bit          _BIT_ACCESS(HLVDCON,3)
// SSPSTAT<I2C_DAT>
extern volatile __bit                   I2C_DAT             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 I2C_DAT_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<I2C_READ>
extern volatile __bit                   I2C_READ            __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 I2C_READ_bit        _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<I2C_START>
extern volatile __bit                   I2C_START           __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 I2C_START_bit       _BIT_ACCESS(SSPSTAT,3)
// SSPSTAT<I2C_STOP>
extern volatile __bit                   I2C_STOP            __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 I2C_STOP_bit        _BIT_ACCESS(SSPSTAT,4)
// TRISE<IBF>
extern volatile __bit                   IBF                 __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 IBF_bit             _BIT_ACCESS(TRISE,7)
// TRISE<IBOV>
extern volatile __bit                   IBOV                __at(0x7CB5);	// @ (0xF96 * 8 + 5)
#define                                 IBOV_bit            _BIT_ACCESS(TRISE,5)
// OSCCON<IDLEN>
extern volatile __bit                   IDLEN               __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(OSCCON,7)
// PORTB<INT0>
extern volatile __bit                   INT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 INT0_bit            _BIT_ACCESS(PORTB,0)
// INTCON<INT0E>
extern volatile __bit                   INT0E               __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0E_bit           _BIT_ACCESS(INTCON,4)
// INTCON<INT0F>
extern volatile __bit                   INT0F               __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0F_bit           _BIT_ACCESS(INTCON,1)
// INTCON<INT0IE>
extern volatile __bit                   INT0IE              __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0IE_bit          _BIT_ACCESS(INTCON,4)
// INTCON<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(INTCON,1)
// PORTB<INT1>
extern volatile __bit                   INT1                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 INT1_bit            _BIT_ACCESS(PORTB,1)
// INTCON3<INT1E>
extern volatile __bit                   INT1E               __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1E_bit           _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1F>
extern volatile __bit                   INT1F               __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1F_bit           _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IE>
extern volatile __bit                   INT1IE              __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1IE_bit          _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IP>
extern volatile __bit                   INT1IP              __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1IP_bit          _BIT_ACCESS(INTCON3,6)
// INTCON3<INT1P>
extern volatile __bit                   INT1P               __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1P_bit           _BIT_ACCESS(INTCON3,6)
// PORTB<INT2>
extern volatile __bit                   INT2                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 INT2_bit            _BIT_ACCESS(PORTB,2)
// INTCON3<INT2E>
extern volatile __bit                   INT2E               __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2E_bit           _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2F>
extern volatile __bit                   INT2F               __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2F_bit           _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IE>
extern volatile __bit                   INT2IE              __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2IE_bit          _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2IF>
extern volatile __bit                   INT2IF              __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2IF_bit          _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IP>
extern volatile __bit                   INT2IP              __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2IP_bit          _BIT_ACCESS(INTCON3,7)
// INTCON3<INT2P>
extern volatile __bit                   INT2P               __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2P_bit           _BIT_ACCESS(INTCON3,7)
// INTCON2<INTEDG0>
extern volatile __bit                   INTEDG0             __at(0x7F8E);	// @ (0xFF1 * 8 + 6)
#define                                 INTEDG0_bit         _BIT_ACCESS(INTCON2,6)
// INTCON2<INTEDG1>
extern volatile __bit                   INTEDG1             __at(0x7F8D);	// @ (0xFF1 * 8 + 5)
#define                                 INTEDG1_bit         _BIT_ACCESS(INTCON2,5)
// INTCON2<INTEDG2>
extern volatile __bit                   INTEDG2             __at(0x7F8C);	// @ (0xFF1 * 8 + 4)
#define                                 INTEDG2_bit         _BIT_ACCESS(INTCON2,4)
// OSCTUNE<INTSCR>
extern volatile __bit                   INTSCR              __at(0x7CDF);	// @ (0xF9B * 8 + 7)
#define                                 INTSCR_bit          _BIT_ACCESS(OSCTUNE,7)
// OSCTUNE<INTSRC>
extern volatile __bit                   INTSRC              __at(0x7CDF);	// @ (0xF9B * 8 + 7)
#define                                 INTSRC_bit          _BIT_ACCESS(OSCTUNE,7)
// OSCCON<IOFS>
extern volatile __bit                   IOFS                __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 IOFS_bit            _BIT_ACCESS(OSCCON,2)
// RCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 IPEN_bit            _BIT_ACCESS(RCON,7)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// HLVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(HLVDCON,5)
// PIE3<IRXIE>
extern volatile __bit                   IRXIE               __at(0x7D1F);	// @ (0xFA3 * 8 + 7)
#define                                 IRXIE_bit           _BIT_ACCESS(PIE3,7)
// PIR3<IRXIF>
extern volatile __bit                   IRXIF               __at(0x7D27);	// @ (0xFA4 * 8 + 7)
#define                                 IRXIF_bit           _BIT_ACCESS(PIR3,7)
// IPR3<IRXIP>
extern volatile __bit                   IRXIP               __at(0x7D2F);	// @ (0xFA5 * 8 + 7)
#define                                 IRXIP_bit           _BIT_ACCESS(IPR3,7)
// HLVDCON<IVRST>
extern volatile __bit                   IVRST               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 IVRST_bit           _BIT_ACCESS(HLVDCON,5)
// RXB0CON<JTOFF>
extern volatile __bit                   JTOFF               __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 JTOFF_bit           _BIT_ACCESS(RXB0CON,1)
// RXB0CON<JTOFF_FILHIT1>
extern volatile __bit                   JTOFF_FILHIT1       __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 JTOFF_FILHIT1_bit   _BIT_ACCESS(RXB0CON,1)
// PORTB<KBI0>
extern volatile __bit                   KBI0                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 KBI0_bit            _BIT_ACCESS(PORTB,4)
// PORTB<KBI1>
extern volatile __bit                   KBI1                __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 KBI1_bit            _BIT_ACCESS(PORTB,5)
// PORTB<KBI2>
extern volatile __bit                   KBI2                __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 KBI2_bit            _BIT_ACCESS(PORTB,6)
// PORTB<KBI3>
extern volatile __bit                   KBI3                __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 KBI3_bit            _BIT_ACCESS(PORTB,7)
// LATA<LA0>
extern volatile __bit                   LA0                 __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 LA0_bit             _BIT_ACCESS(LATA,0)
// LATA<LA1>
extern volatile __bit                   LA1                 __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 LA1_bit             _BIT_ACCESS(LATA,1)
// LATA<LA2>
extern volatile __bit                   LA2                 __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 LA2_bit             _BIT_ACCESS(LATA,2)
// LATA<LA3>
extern volatile __bit                   LA3                 __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 LA3_bit             _BIT_ACCESS(LATA,3)
// LATA<LA4>
extern volatile __bit                   LA4                 __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 LA4_bit             _BIT_ACCESS(LATA,4)
// LATA<LA5>
extern volatile __bit                   LA5                 __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 LA5_bit             _BIT_ACCESS(LATA,5)
// LATA<LA6>
extern volatile __bit                   LA6                 __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 LA6_bit             _BIT_ACCESS(LATA,6)
// LATA<LA7>
extern volatile __bit                   LA7                 __at(0x7C4F);	// @ (0xF89 * 8 + 7)
#define                                 LA7_bit             _BIT_ACCESS(LATA,7)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x7C4F);	// @ (0xF89 * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
